{"author":{"avatar":"/assets/32x32_avatar.jpg","name":"Liam","tagline":"Make people great again!"},"data":"\n## Course Syllabus\n- Week 1: Introduction.  Asymptotic analysis including big-oh notation.  Divide-and-conquer algorithms for sorting, counting inversions, matrix multiplication, and closest pair.\n\n- Week 2: Running time analysis of divide-and-conquer algorithms.  The master method.  Introduction to randomized algorithms, with a probability review.  QuickSort.\n\n- Week 3: More on randomized algorithms and probability.  Computing the median in linear time.  A randomized algorithm for the minimum graph cut problem.\n\n- Week 4: Graph primitives.  Depth- and breadth-first search.  Connected components in undirected graphs.  Topological sort in directed acyclic graphs.  Strongly connected components in directed graphs.\n\n- Week 5: Dijkstra's shortest-path algorithm.  Introduction to data structures.  Heaps and applications.\n\n- Week 6: Further data structures.  Hash tables and applications.  Balanced binary search trees\n\n## Comments On The Course\nQuite like this course as I have not take standard algorithm course in my university. In this course, I've learn how the algorithm works and its theory.\n\nThe course coding assignment is not bad though. I've been using python to solve this 6 week code assignment.\n\nAbout the lecture, its not quite easy to understand without some programming background. Even I listen to the course, I also have to wiki or stackoverflow to know more about the lecture material.\n\nToday is week 6 for this course, therefore the statement of accomplishment should be coming out in the coming few weeks. This is what I like for stanford university also. Usually their course will provide a statement of accomplishment during the end of the course.\n\nOverall, I'll give a 4 out of 5 star rating to this course.\n\n        ","description":"\nQuite like this course as I have not take standard algorithm course in my university. In this course, I've learn how the algorithm works and its theory.\n\nThe course coding assignment is not bad though. I've been using python to solve this 6 week code assignment.\n    ","id":"fd4938dc-f35b-4ab5-9e9e-39ae28dcde51","bannerUrl":"/assets/2015080800.jpg","coverUrl":"/assets/2015080800.jpg","postedAt":"2015-08-07T16:00:00.000Z","tags":["mooc","computer-science"],"title":"Coursera course review - Algorithms","typeCode":1}