{"author":{"avatar":"/assets/32x32_avatar.jpg","name":"Liam","tagline":"Make people great again!"},"data":"\n[Machine Learning by Andrew Ng @ STANFORD UNIVERSITY](https://www.coursera.org/learn/machine-learning/home/info).\n\n[Andrew Ng](https://www.coursera.org/instructor/andrewng) is Associate Professor of Computer Science at Stanford; Chief Scientist of Baidu; and Chairman and Co-founder of Coursera.\nHis machine learning course is the MOOC that had led to the founding of Coursera!\n\n## Course Summary\n\nThis course provides a broad introduction to machine learning, datamining, and statistical pattern recognition.\nTopics include:\n\n- Supervised learning (parametric/non-parametric algorithms, support vector machines, kernels, neural networks).\n- Unsupervised learning (clustering, dimensionality reduction, recommender systems, deep learning).\n- Best practices in machine learning (bias/variance theory; innovation process in machine learning and AI).\n\nThe course will also draw from numerous case studies and applications, so that you'll also learn how to apply learning\n  algorithms to building smart robots (perception, control), text understanding (web search, anti-spam), computer vision,\n  medical informatics, audio, database mining, and other areas.\n\n## Comments On The Course\n\nStanford University has done a good job in managing courses in coursera, all the courses is in good quality. This machine\nlearning course is my first course in coursera, and also the first course that give me basic knowledge about machine\nlearning.\n\nAt this course, Andrew Ng has given us a lot of programming assignment to solve it in octave, which include coding\nfor support vector machines, clustering and neural network.\n\nI wish that Andrew Ng has given more lecture on machine learning. His lecture is clear and meaningful, definitely a\n5 star rating course.\n        ","id":"de1c1d4c-6b1f-495a-aaa6-9ad8fef65471","bannerUrl":"/assets/2015070300.png","coverUrl":"/assets/2015070300.png","postedAt":"2015-07-03T16:00:00.000Z","tags":["mooc","machine-learning"],"title":"Coursera course review - Machine Learning by Andrew Ng","typeCode":1}