{"author":{"avatar":"/assets/32x32_avatar.jpg","name":"Liam","tagline":"Make people great again!"},"data":"\n## Edit on year Jun 19, 2018\nProject has been discontinued due to Koa2 + Graphql basically can do what I plan to do. Looking back from now, I find that there are a lot to be improved for this project, luckily there are a lot of alternative out there and this project can be discontinued.\n\n## Intro\nIt has been awhile since I have been inactive in open-source world. Although nowadays trend is in VR, AI and iOT, API development is still needed.\n\n[FawkesJs](https://github.com/fawkesjs/fawkesjs) is a Javascript framework that is built on top of express, typescript and MVC structure. Inspired by Laravel and Loopback, the target of the framework is to make Javascript development even easier.\n\n## Build in structure in this project\n- Express\n- Sequelize\n- Typescript\n- Swagger: use `fawkesjs -s ./swagger/swagger.json` to generate swagger document\n- Express Rest Param Validation: integration with swagger document generation\n- Acl (inside `fawkesjs-starter/src/module`)\n- AccessToken (inside `fawkesjs-starter/src/module`)\n\n## Why FawkesJs\n- NodeJS has good async support that PHP lack of\n- Laravel is the first choice in PHP, however NodeJS is still full of framework choices\n- Express in NodeJS is good, however its too minimalist.\n- Loopback is good, however personally I think Laravel structure is somehow better than Loopback - more organized\n- With Typescript, we can have better type checking during development time. Convenient to develop with atom\n- Name is just a symbol, its so hard to come out with a good naming\n- Rust seems promising, however I'm still waiting for Hyper to implement async IO.\n\n## Usage\n- git clone https://github.com/fawkesjs/fawkesjs-starter\n- follow the README\n    ","id":"6b83d7ff-0e93-422a-b2d8-95b62e90ccd0","bannerUrl":null,"coverUrl":null,"postedAt":"2017-02-04T16:00:00.000Z","tags":["nodejs","opensource"],"title":"Introduce FawkesJs","typeCode":1}