{"author":{"avatar":"/assets/32x32_avatar.jpg","name":"Liam","tagline":"Make people great again!"},"data":"\n## Why Lubuntu\nAs a developer, you must have heard of ubuntu. FYI, Lubuntu is a light weight version of Ubuntu. Using Lubuntu, you can have more control on your PC.\n\n## Advantage for replacing Windows for Lubuntu\n- Combination of Windows 7 with command line feeling\n- Directly use docker container to run application instead of virtualbox, which provide a higher speed.\n- Faster speed for most of the program, for example android-studio. This might be due to less backend application run in Windows (And it is hard to disable those application).\n- More control on the system and more debug message can be seen.\n\n## Disadvantage for using Lubuntu\n- Most gaming software run natively in windows, the worst things is I have installed lubuntu xenial 16.04LTS version and they have dropped support for my AMD RADEON graphic card model,\n- The UI is not as beautiful as Windows\n\n## Some bug Fix\n- Fix no sound\n\n~~~\ninstall restrict-ubuntu\n~~~\n- Fix frequent crash in dell inspiron graphic card: upgrade from kernel 4.4 to kernel 4.6\n- Local Support: go to start > Preferences > Language Support\n- Unable to start docker: sudo docker daemon -D -s vfs\n\n## Some example\n- Run this blog locally\n\n~~~bash\ncd /e/nghenglim.github.io/ # contain the repo\nsudo docker run -d -v \"$PWD:/src\" -p 4000:4000 grahamc/jekyll serve -H 0.0.0.0\n~~~\n\n## Conclusion\nIf graphic card is not supported by Lubuntu, the best setup will be dual boot Lubuntu and Windows. Play games and watch movie in Windows, however do development in Lubuntu.\n    ","description":"\nAs a developer, you must have heard of ubuntu. FYI, Lubuntu is a light weight version of Ubuntu. Using Lubuntu, you can have more control on your PC.\n    ","id":"e699dc4f-0d96-498d-ba07-0e692dace0ea","bannerUrl":"/assets/2016061100.png","coverUrl":"/assets/2016061100.png","postedAt":"2016-06-10T16:00:00.000Z","tags":["lubuntu"],"title":"Lubuntu to replace Window","typeCode":1}