{"author":{"avatar":"/assets/32x32_avatar.jpg","name":"Liam","tagline":"Make people great again!"},"data":"\n## AlphaGo\nQuoting from wikipedia, as of 12 Mar 2016:\n\n> AlphaGo is a computer program developed by Google DeepMind in London to play the board game Go. In October 2015, it became the first computer Go program to beat a professional human Go player without handicaps on a full-sized 19×19 board. In March 2016, it beat Lee Sedol in the first three games in a five-game match, the first time a computer Go program has beaten a 9-dan professional without handicaps.\n>\n> AlphaGo's algorithm uses a combination of machine learning and tree search techniques, combined with extensive training, both from human and computer play.\n\n## Why AlphaGo Wins Matter - Comparing to Watson\n- Watson\n  - Brute force + NLP + Advantages of without using hand to press button\n  - Does not actually represent what a human mind is doing\n  - Most probably require large amount of computer resources when operating\n- AlphaGo\n  - Deep Learning + Monte-Carlo tree search + Use human hand to place stones on board and stop the timer\n  - Deep Learning is like human mind to do long short term memory + image recognition (which is quite important in Go)\n  - Monte-Carlo tree search is like human mind do some calculation after he/she thinks about a good spot\n  - It require more resources during training (for deep learning part), however the resource needed when match against human is significantly lower.\n\n## New Milestone For AI\nThe winning of AlphaGo is a new milestone for AI, and it also will brings new impact to our world.\n\n- The business will accelerate the usage of AI applications and robotic.\n- Amazed by AlphaGo, the people will easier accept that current AI starting to outperform them in many area.\n\nI can see the coming of the second machine age and it will come lots sooner then we think, I will guess that it will be within this 5 year.\n    ","description":"\nQuoting from wikipedia, as of 12 Mar 2016:\n\n> AlphaGo is a computer program developed by Google DeepMind in London to play the board game Go. In October 2015, it became the first computer Go program to beat a professional human Go player without handicaps on a full-sized 19×19 board. In March 2016, it beat Lee Sedol in the first three games in a five-game match, the first time a computer Go program has beaten a 9-dan professional without handicaps.\n>\n> AlphaGo's algorithm uses a combination of machine learning and tree search techniques, combined with extensive training, both from human and computer play.\n    ","id":"c2f84dc7-91eb-4624-8e41-af4b97314a05","bannerUrl":"/assets/2016031200.png","coverUrl":"/assets/thumb-150-2016031200.png","postedAt":"2016-03-11T16:00:00.000Z","slug":"alphaGo-win-lee-sedol-new-milestone-for-ai-@b5VTZauHF9VsXuyrichiwex","tags":["article"],"title":"AlphaGo Win Lee Sedol, New Milestone for AI","typeCode":1}